import React from 'react'
import '../css/home/home.css';

function Documentation() {
  return (
    <section id='dashboard-main' className='main-container'>
        <div className="documentation-block">
            <h1>Статистика</h1>
            <ol className='documentation'>
                <li>
                    Чтобы добавить позицию в проект, нажмите "Добавить проект...", выберите проект в выпадающем меню, заполните данные и нажмите 
                    на кнопку <strong>"➕".</strong>
                </li>
                <li>
                    Чтобы удалить позицию в проекте, сперва выберите проект в верхнем меню, а затем нажмите на корзину справа.
                </li>
                <li>
                    Для изменения названия проекта, нажмите на "Название проекта" и введите нужное вам название.
                </li>
            </ol>
        </div>
        <div className="documentation-block">
            <h1>Затраты</h1>
            <ol className='documentation'>
                <li>
                    Чтобы добавить позицию в проект, нажмите "Добавить проект...", выберите проект в выпадающем меню, заполните данные и нажмите 
                    на кнопку <strong>"➕".</strong>
                </li>
                <li>
                    Чтобы удалить позицию в проекте, сперва выберите проект в верхнем меню, а затем нажмите на корзину справа.
                </li>
                <li>
                    Для изменения названия проекта, нажмите на "Название проекта" и введите нужное вам название.
                </li>
            </ol>
        </div>
        <div className="documentation-block">
            <h1>Инвентарь</h1>
            <ol className='documentation'>
                <li>
                    Чтобы добавить позицию в проект, нажмите "Добавить проект...", выберите проект в выпадающем меню, заполните данные и нажмите 
                    на кнопку <strong>"➕".</strong>
                </li>
                <li>
                    Чтобы удалить позицию в проекте, сперва выберите проект в верхнем меню, а затем нажмите на корзину справа.
                </li>
                <li>
                    Для изменения названия проекта, нажмите на "Название проекта" и введите нужное вам название.
                </li>
            </ol>
        </div>
        <div className="documentation-block">
            <h1>Настройки</h1>
            <ol className='documentation'>
                <li>
                    Чтобы добавить позицию в проект, нажмите "Добавить проект...", выберите проект в выпадающем меню, заполните данные и нажмите 
                    на кнопку <strong>"➕".</strong>
                </li>
                <li>
                    Чтобы удалить позицию в проекте, сперва выберите проект в верхнем меню, а затем нажмите на корзину справа.
                </li>
                <li>
                    Для изменения названия проекта, нажмите на "Название проекта" и введите нужное вам название.
                </li>
            </ol>
        </div>
    </section>
  )
}

export default Documentation